app/helpers/events_helper.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_event
    @event = Event.find(params[:id])