app/helpers/sessions_helper.rb

  def current_user
    @current_user ||= User.find_by(name: session[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Maria Jose Reyes Parroquin"], ["LIMIT", 1]]