app/controllers/events_controller.rb

  def create
    @user = User.find_by(remember_token: cookies[:remember_token])
    @event = @user.events.build(event_params)
    if @event.save
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "events" ("name", "description", "date", "location", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?, ?)