app/controllers/sessions_controller.rb

  def create
    if (user = User.find_by(name: params[:session][:name]))
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "User Example"], ["LIMIT", 1]]